{"meta":{"title":"流体智能分析与控制小组","subtitle":"ModFluids Team","description":"研究小组","author":"LYL","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2025-05-03T10:25:01.000Z","updated":"2025-05-03T14:20:55.437Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"李炳华 博士Dr. Binghua Li专业： 流体力学Expertise:Fluid Mechanics, AI4ScienceResearch Focus:Modal analysis, Turbulent flow controlEducation Ph.D. in Aeronautic Engineering, Polytechnic University of Madrid (UPM), Sept 2018 - Feb 2022 Thesis: Dynamic Mode Decomposition Based Algorithms as Feature Detection Techniques:Application to Large Flow Databases.[DOI] Supervisor: Prof. Eusebio Valero and Dr. Jesús Garicano-Mena. Ph.D. in Fluid Mechanics, Zhejiang University (ZJU), Sept 2015 - Sept 2021 Thesis: Feature Extraction Method of Turbulent Boundary Layer and Its Applications Based on Dynamic Mode Decomposition. Supervisor: Prof. Yao Zheng (CN&#x2F;EN). B.Sc. in Aircraft Design and Engineering, Northwestern Polytechnical University (NPU), Sept 2011 - July 2015 Thesis: Aerodynamic Shape Optimization Design of Aircraft Based on Genetic Algorithm. Supervisor: Prof. Min Xu and Prof. Xiaomin An (CN&#x2F;EN). Work experience Spring 2024: Interim Associate Professor Beihang University Duties included: Study on data-driven feature extraction methods and application of fluid mechanics on reliability theory Collaborator: Prof. Rui Kang (CN&#x2F;EN) Spring 2022: Post Doctor Zhejiang University Duties included: Study on multiphase flow simulation of smoke in porous filters and development of filter product design models Supervisor: Prof. Jiaqi Luo (CN&#x2F;EN) Fall 2021: AI algorithms engineer The China Financial Futures Exchange Duties included: R&amp;D of NLP algorithms on large text content Supervisor: Dr. Zhongchen Miao Skills Programming Python (Pandas, PyTorch, NumPy, Scikit‑learn. etc.) MATLAB Fortran Productivity ANSYS, Linux, Shell (Bash&#x2F;Zsh), Git LaTex(Overleaf&#x2F;Markdown), Microsoft Oﬀice Languages English: IELTS B2 Spanish: UPM Language Center B1 Publications A composite dynamic mode decomposition analysis of turbulent channel flowsJesús Garicano-Mena, Binghua Li, Esteban Ferrer, Eusebio Valero. (2019) “A composite dynamic mode decomposition analysis of turbulent channel flows” Physics of Fluids. 31(11):115102. Dynamic Mode Decomposition Analysis of Spatially Agglomerated Flow DatabasesBinghua Li, Jesús Garicano-Mena, Yao Zheng, Eusebio Valero. (2020) “Dynamic Mode Decomposition Analysis of Spatially Agglomerated Flow Databases” Energies. 13(9):2134. A dynamic mode decomposition technique for the analysis of non–uniformly sampled flow dataBinghua Li, Jesús Garicano-Mena, Eusebio Valero. (2022) “A dynamic mode decomposition technique for the analysis of non–uniformly sampled flow data” Journal of Computational Physics. 468(3):111495. Academic Advising Design Optimization of Fan Blade Using RBF‑based Neural Network, Jun 2023 Zhen Fu, master thesis at ZJU Co-supervised with Prof. Jiaqi Luo. On the application of variants of the DMD and POD algorithms for the analysis of Turbulent Channel Flow, Jun 2019 Xiyu Wang, bachelor thesis at NPU Co-supervised with Dr. Jesús Garicano-mena. Journal Reviewer Physics of Fluid Ocean Engineering Energies Honors and Awards 2022, Sobresaliente cum laude(Outstanding with highest honors), UPM Graduate Record 2021, Outstanding Graduates of Zhejiang University in 2021, Academic Committee of ZJU 2018, Joint training PhD candidate Funding, China Scholarship Council Annual Program 2017, Excellent PhD Candidate Position Grants, ZJU PhD Candidate Mid‑term Defence 2015, Meritorious Winner (Global Top 2%), Interdisciplinary Contest in Modeling of America (ICM) 2013, Outstanding Winner and Special‑class Scholarship (Top 10&#x2F;all), NPU Undergraduates Annual Defence 2012, National Scholarship, Ministry of Education of the People’s Republic of China"},{"title":"members","date":"2025-01-02T06:42:54.000Z","updated":"2025-07-02T06:46:29.839Z","comments":false,"path":"members/index.html","permalink":"http://example.com/members/index.html","excerpt":"","text":"小组介绍&#x2F;Team Introduction老师&#x2F;Teachers 李炳华 博士 叶洲腾 博士 Dr. Binghua Li Dr. Zhouteng Ye 专业： 流体力学 专业： 流体力学 Expertise: Fluid Mechanics, AI4Science Expertise: Computational Fluid Dynamics, AI4CFD Research Focus: Research Focus: Modal analysis, Turbulent flow control. Multi-phase flow, Physics informed machine learning. 学生&#x2F;Students 甘天源 张璐璐 郑楠 李帅超 Tianyuan Gan Lulu Zhang Nan Zheng Shuaichao Li Research Focus: Research Focus: Research Focus: Research Focus: Micro-blowing for drag reduction Joint drag reduction technology Causality analysis of flow modes Turbulence Interpretability based on ML Undergraduate Uni.: NCHU(昌航) Undergraduate Uni.：DMU(大连海大) Undergraduate Uni.: BJTU(北交大) Undergraduate Uni.: BUAA(北航)"},{"title":"publications","date":"2024-01-02T06:40:24.000Z","updated":"2025-07-02T06:42:17.422Z","comments":false,"path":"publications/index.html","permalink":"http://example.com/publications/index.html","excerpt":"","text":"近半年学术成果： 一种用于多团队灾后修复性维修决策的深度Actor-Critic架 构系统，2025.02，ZL202411282244.3。 一种无人旋翼机动力单元故障诊断方法、系统和无人旋翼机，2024.11，ZL202411235100.2。 Han, D.Y., Li, B., Kang R., Wang H.W., Liang Z.R., &amp; Yu J.S. (2024). An Unknown Input Observer-Based Fault Diagnosis Method of eVTOL Under Closed-Loop Control. ICSRS 2024. (EI indexed) [DOI] Li, S.C., Zhang, L.L., Han, D.Y., Li, B.*, Wang H.W., &amp; Kang, R. (2024). Capacity Prediction of Lithium-ion Batteries with Regeneration Phenomena Based on Hierarchical Modal Analysis. ICSRS 2024. (EI indexed) [DOI] 近五年论文成果： Li, B., Garicano-Mena, J.*, &amp; Valero, E. (2022). A dynamic mode decomposition technique for the analysis of non–uniformly sampled flow data. Journal of Computational Physics, 468, 111495. Li, B., Garicano-Mena, J.*, Zheng, Y., &amp; Valero, E. (2020). Dynamic mode decomposition analysis of spatially agglomerated flow databases. Energies, 13(9), 2134. Li, B.*, Garicano-Mena, J. &amp; Valero, E. (2020). Feature Extraction from Turbulent Channel Flow Databases via Composite DMD Analysis. Journal of Physics: Conference Series, 1522, 012008. Garicano-Mena, J., Li, B.*, Ferrer E., and Valero E. (2019). A composite dynamic mode decomposition analysis of turbulent channel flows. Physics of Fluids, 31, no. 1: 115102. Ye, Z., Estebe, C., Liu, Y., Vahab, M., Huang, Z., Sussman, M., Moradikazerouni, A., Shoele, K,. Lian, Y., Ohta, M., &amp; Hussaini, M. Y. (2023). An Improved Coupled Level Set and Continuous Moment-of-Fluid Method for Simulating Multiphase Flows with Phase Change. Communications on Applied Mathematics and Computation, 1-36. Ye, Z. (2023). A comparative study of split advection algorithms on the moment-of-fluid (MOF) method for incompressible flow. Computers &amp; Fluids, 255, 105815. Ye, Z., Shi, F., Zhao, X., Hu, Z., &amp; Malej, M. (2021). A data-driven approach to modeling subgrid-scale shallow marsh hydrodynamics. Coastal Engineering, 166, 103856. 往年论文成果： Li, B.*, Huang, X. W., Zheng, Y., Xie, F. F., Wang, J., &amp; Zou, J. F. (2018). Performance of flapping airfoil propulsion with LBM method and DMD analysis. Modern Physics Letters B, 32(12n13), 1840024. Ye, Z., &amp; Zhao, X. (2017). Investigation of water-water interface in dam break flow with a wet bed. Journal of Hydrology, 548, 104-120. Ye, Z., Zhao, X., &amp; Deng, Z. (2016). Numerical investigation of the gate motion effect on a dam break flow. Journal of Marine Science and Technology, 21, 579-591. 1&lt;/div&gt;"}],"posts":[{"title":"杭州黄龙","slug":"杭州黄龙","date":"2025-12-02T06:17:46.000Z","updated":"2025-07-02T06:28:46.526Z","comments":true,"path":"2025/12/02/杭州黄龙/","permalink":"http://example.com/2025/12/02/%E6%9D%AD%E5%B7%9E%E9%BB%84%E9%BE%99/","excerpt":"","text":"2024.12 @杭州黄龙李炳华博士参加杭州市低空经济产业联合会首届大会 作为会员代表参加低空经济大会，感受关于无人机全生命周期的产学研热度","categories":[],"tags":[]},{"title":"杭州瓶窑","slug":"杭州瓶窑","date":"2025-05-15T06:18:59.000Z","updated":"2025-07-02T06:34:09.611Z","comments":true,"path":"2025/05/15/杭州瓶窑/","permalink":"http://example.com/2025/05/15/%E6%9D%AD%E5%B7%9E%E7%93%B6%E7%AA%91/","excerpt":"","text":"2025.05@杭州瓶窑小组邀请浙江大学谢芳芳副教授来国新院交流报告 李炳华、陈松老师邀请浙大飞推所副所长、国家级青年人才谢芳芳老师来访智慧民航科创中心，分享《机器学习赋能飞行器流动建模、优化和控制》精彩报告，并参观仿生飞行器、跨介质飞行器、航空大数据实验室，碰撞关于AI4Fluids的深度合作领域。","categories":[],"tags":[]},{"title":"杭州西湖大学","slug":"杭州西湖大学","date":"2025-05-11T06:18:43.000Z","updated":"2025-07-02T06:34:26.474Z","comments":true,"path":"2025/05/11/杭州西湖大学/","permalink":"http://example.com/2025/05/11/%E6%9D%AD%E5%B7%9E%E8%A5%BF%E6%B9%96%E5%A4%A7%E5%AD%A6/","excerpt":"","text":"2025.05@杭州西湖课题组全员受邀前往西湖大学范迪夏实验室参访交流 初夏艳阳，课题组与中心老师组团前往西湖大学参访。范迪夏教授对西湖校园及其流体智能与信息化实验室的理念和进展做详细介绍，随后的研讨会点燃了关于上天入海的头脑风暴！","categories":[],"tags":[]},{"title":"北京海淀","slug":"北京海淀","date":"2025-04-02T06:18:27.000Z","updated":"2025-07-02T06:32:44.853Z","comments":true,"path":"2025/04/02/北京海淀/","permalink":"http://example.com/2025/04/02/%E5%8C%97%E4%BA%AC%E6%B5%B7%E6%B7%80/","excerpt":"","text":"2025.04@北京海淀小组成员参加第二届空天前沿大会（航空学报60周年） 小组全员相聚北京，领略顶刊办顶会的风采。了解空天领域最前沿，开拓研究合作新思路。 SAC-News","categories":[],"tags":[]},{"title":"杭州校园","slug":"杭州校园","date":"2025-03-02T06:18:14.000Z","updated":"2025-07-02T06:31:14.792Z","comments":true,"path":"2025/03/02/杭州校园/","permalink":"http://example.com/2025/03/02/%E6%9D%AD%E5%B7%9E%E6%A0%A1%E5%9B%AD/","excerpt":"","text":"北航第十七期青年教师教学业务培训基础班结业 北航第十八期青年教师教学业务培训基础班开班，北航杭州国际校园设分会场","categories":[],"tags":[]},{"title":"日本札幌","slug":"日本札幌","date":"2025-01-02T06:17:58.000Z","updated":"2025-07-02T06:29:45.695Z","comments":true,"path":"2025/01/02/日本札幌/","permalink":"http://example.com/2025/01/02/%E6%97%A5%E6%9C%AC%E6%9C%AD%E5%B9%8C/","excerpt":"","text":"2025.01 @日本札幌李炳华博士前往北海道大学工学部交流 邀约前往北海道大学工学部流体控制与计算流体力学实验室参观交流","categories":[],"tags":[]},{"title":"意大利西西里岛","slug":"意大利西西里岛","date":"2024-11-02T06:17:32.000Z","updated":"2025-07-02T06:28:12.547Z","comments":true,"path":"2024/11/02/意大利西西里岛/","permalink":"http://example.com/2024/11/02/%E6%84%8F%E5%A4%A7%E5%88%A9%E8%A5%BF%E8%A5%BF%E9%87%8C%E5%B2%9B/","excerpt":"","text":"2024.11 @意大利西西里岛李帅超、张璐璐线上参加2024 ICSRS国际会议并做学术报告 报告题目：基于层次化模态分析的再生现象下锂离子电池寿命预测","categories":[],"tags":[]},{"title":"杭州良渚","slug":"杭州良渚","date":"2024-10-12T06:17:14.000Z","updated":"2025-07-02T06:27:26.984Z","comments":true,"path":"2024/10/12/杭州良渚/","permalink":"http://example.com/2024/10/12/%E6%9D%AD%E5%B7%9E%E8%89%AF%E6%B8%9A/","excerpt":"","text":"2024.10 @杭州良渚研究小组秋日聚会 月度小组活动，聚餐后到访叶老师home party","categories":[],"tags":[]},{"title":"苏州太仓","slug":"苏州太仓","date":"2024-10-02T06:16:57.000Z","updated":"2025-07-02T06:26:44.220Z","comments":true,"path":"2024/10/02/苏州太仓/","permalink":"http://example.com/2024/10/02/%E8%8B%8F%E5%B7%9E%E5%A4%AA%E4%BB%93/","excerpt":"","text":"2024.10 @苏州太仓李炳华博士参加2024 MEAE国际会议并做邀请报告 报告题目：基于动态模态分解的大规模流场特征分析技术研究 Report Title: Dynamic Mode Decomposition Based Algorithms as Feature Detection Techniques: Application to Large Flow Databases","categories":[],"tags":[]},{"title":"杭州余杭径山","slug":"杭州余杭径山","date":"2024-09-02T06:16:40.000Z","updated":"2025-07-02T06:25:55.365Z","comments":true,"path":"2024/09/02/杭州余杭径山/","permalink":"http://example.com/2024/09/02/%E6%9D%AD%E5%B7%9E%E4%BD%99%E6%9D%AD%E5%BE%84%E5%B1%B1/","excerpt":"","text":"2024.9 @杭州余杭径山研究小组千年古刹径山寺一日游 夏末初秋，小组前往千年古刹径山寺进行了一次丰富充实的徒步秋游活动。","categories":[],"tags":[]},{"title":"新加坡学术交流","slug":"新加坡学术交流","date":"2024-07-02T06:15:18.000Z","updated":"2025-07-02T06:25:09.768Z","comments":true,"path":"2024/07/02/新加坡学术交流/","permalink":"http://example.com/2024/07/02/%E6%96%B0%E5%8A%A0%E5%9D%A1%E5%AD%A6%E6%9C%AF%E4%BA%A4%E6%B5%81/","excerpt":"","text":"2024.7 @新加坡李炳华博士前往新加坡做学术交流 趁着暑假间隙，前往新加坡国立大学拜访流体力学先驱 舒昌 教授，及南阳理工大学软物质力学青年才俊 令狐昌鸿 老师。","categories":[],"tags":[]}],"categories":[],"tags":[]}