{"meta":{"title":"流体智能分析与控制小组","subtitle":"ModFluids Team","description":"研究小组","author":"LYL","url":"http://example.com","root":"/"},"pages":[{"title":"about","date":"2025-05-03T10:25:01.000Z","updated":"2025-05-03T14:20:55.437Z","comments":false,"path":"about/index.html","permalink":"http://example.com/about/index.html","excerpt":"","text":"李炳华 博士Dr. Binghua Li专业： 流体力学Expertise:Fluid Mechanics, AI4ScienceResearch Focus:Modal analysis, Turbulent flow controlEducation Ph.D. in Aeronautic Engineering, Polytechnic University of Madrid (UPM), Sept 2018 - Feb 2022 Thesis: Dynamic Mode Decomposition Based Algorithms as Feature Detection Techniques:Application to Large Flow Databases.[DOI] Supervisor: Prof. Eusebio Valero and Dr. Jesús Garicano-Mena. Ph.D. in Fluid Mechanics, Zhejiang University (ZJU), Sept 2015 - Sept 2021 Thesis: Feature Extraction Method of Turbulent Boundary Layer and Its Applications Based on Dynamic Mode Decomposition. Supervisor: Prof. Yao Zheng (CN&#x2F;EN). B.Sc. in Aircraft Design and Engineering, Northwestern Polytechnical University (NPU), Sept 2011 - July 2015 Thesis: Aerodynamic Shape Optimization Design of Aircraft Based on Genetic Algorithm. Supervisor: Prof. Min Xu and Prof. Xiaomin An (CN&#x2F;EN). Work experience Spring 2024: Interim Associate Professor Beihang University Duties included: Study on data-driven feature extraction methods and application of fluid mechanics on reliability theory Collaborator: Prof. Rui Kang (CN&#x2F;EN) Spring 2022: Post Doctor Zhejiang University Duties included: Study on multiphase flow simulation of smoke in porous filters and development of filter product design models Supervisor: Prof. Jiaqi Luo (CN&#x2F;EN) Fall 2021: AI algorithms engineer The China Financial Futures Exchange Duties included: R&amp;D of NLP algorithms on large text content Supervisor: Dr. Zhongchen Miao Skills Programming Python (Pandas, PyTorch, NumPy, Scikit‑learn. etc.) MATLAB Fortran Productivity ANSYS, Linux, Shell (Bash&#x2F;Zsh), Git LaTex(Overleaf&#x2F;Markdown), Microsoft Oﬀice Languages English: IELTS B2 Spanish: UPM Language Center B1 Publications A composite dynamic mode decomposition analysis of turbulent channel flowsJesús Garicano-Mena, Binghua Li, Esteban Ferrer, Eusebio Valero. (2019) “A composite dynamic mode decomposition analysis of turbulent channel flows” Physics of Fluids. 31(11):115102. Dynamic Mode Decomposition Analysis of Spatially Agglomerated Flow DatabasesBinghua Li, Jesús Garicano-Mena, Yao Zheng, Eusebio Valero. (2020) “Dynamic Mode Decomposition Analysis of Spatially Agglomerated Flow Databases” Energies. 13(9):2134. A dynamic mode decomposition technique for the analysis of non–uniformly sampled flow dataBinghua Li, Jesús Garicano-Mena, Eusebio Valero. (2022) “A dynamic mode decomposition technique for the analysis of non–uniformly sampled flow data” Journal of Computational Physics. 468(3):111495. Academic Advising Design Optimization of Fan Blade Using RBF‑based Neural Network, Jun 2023 Zhen Fu, master thesis at ZJU Co-supervised with Prof. Jiaqi Luo. On the application of variants of the DMD and POD algorithms for the analysis of Turbulent Channel Flow, Jun 2019 Xiyu Wang, bachelor thesis at NPU Co-supervised with Dr. Jesús Garicano-mena. Journal Reviewer Physics of Fluid Ocean Engineering Energies Honors and Awards 2022, Sobresaliente cum laude(Outstanding with highest honors), UPM Graduate Record 2021, Outstanding Graduates of Zhejiang University in 2021, Academic Committee of ZJU 2018, Joint training PhD candidate Funding, China Scholarship Council Annual Program 2017, Excellent PhD Candidate Position Grants, ZJU PhD Candidate Mid‑term Defence 2015, Meritorious Winner (Global Top 2%), Interdisciplinary Contest in Modeling of America (ICM) 2013, Outstanding Winner and Special‑class Scholarship (Top 10&#x2F;all), NPU Undergraduates Annual Defence 2012, National Scholarship, Ministry of Education of the People’s Republic of China"}],"posts":[{"title":"Test","slug":"Test","date":"2025-04-26T13:42:51.000Z","updated":"2025-04-26T14:06:29.502Z","comments":true,"path":"2025/04/26/Test/","permalink":"http://example.com/2025/04/26/Test/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Hello World","slug":"hello-world","date":"2025-04-25T13:03:11.091Z","updated":"2025-04-26T13:13:26.060Z","comments":true,"path":"2025/04/25/hello-world/","permalink":"http://example.com/2025/04/25/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}],"categories":[],"tags":[]}